app/controllers/homes_controller.rb

INSERT INTO "contacts" ("name", "email", "phone", "message", "subject", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def contact_us
    @contact = Contact.new(contact_params)
    if @contact.save